trade_exp/src/DataProcessors/КлиентБанк/КлиентБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КлиентБанк</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ОтчетОВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="844403ae-13ef-4788-a892-258713ee38c4">
    <name>ОтчетОЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9be003a7-74c5-4325-b7f3-895f6501902b">
    <name>ПроводитьДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a24a929a-d5f9-498e-ba12-274230163768">
    <name>СоздаватьКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Эквайер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЭквайера</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="33b28cec-f67c-4b61-9b0b-fa4771747e08">
    <name>РежимЗаполненияКонтрагентаПоQRПлатежу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоследнейВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НастройкаОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КВыгрузке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЕстьВозможностьПрямогоОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcefc53b-6b8d-41cf-bac9-432c76e90c0f">
      <name>ПоследняяВыписка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыКВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОписаниеОшибок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c0ff1ac-e94a-4cfe-a37b-672925c1bcdc">
    <name>Файлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7366c22f-5098-4e87-97eb-dbad1129afd3">
    <name>ДокументыКЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/DataProcessors/КлиентБанк/Forms/ВыгрузкаВБанк/Module.bsl
&НаКлиенте
Процедура Обр__ПронумероватьДокументыПосле(Команда)
	ОчиститьСообщения();

	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	
	ПоказатьВводЗначения(
		Новый ОписаниеОповещения("ВводНомераДокументаЗавершение", ЭтотОбъект), 
		"", 
		НСтр("ru = 'Введите номер последнего документа'"),
		Новый ОписаниеТипов(Массив, , , Новый КвалификаторыЧисла(12,0)));
КонецПроцедуры 

&НаКлиенте
Процедура ВводНомераДокументаЗавершение(НомерДокумента,ОповещениеУспешногоВвода) Экспорт
	ВводНомераДокументаЗавершениеВводНомераСервер(НомерДокумента,ОповещениеУспешногоВвода);
КонецПроцедуры

&НаСервере
Процедура ВводНомераДокументаЗавершениеВводНомераСервер(НомерДокумента,ОповещениеУспешногоВвода)
	если НомерДокумента<>неопределено тогда
		для каждого стр из Объект.ДокументыКВыгрузке цикл
			если стр.Выгружать тогда
				если типзнч(стр.ссылка)=тип("Документссылка.СписаниеБезналичныхДенежныхСредств") тогда
					попытка
						Номердокумента=НомерДокумента+1;
						Док=стр.ссылка.ПолучитьОбъект();
						стр.НомерВходящегоДокумента=стрзаменить(строка(Номердокумента),символы.НПП,"");
						Док.НомерВходящегоДокумента=стрзаменить(строка(Номердокумента),символы.НПП,"");
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(Док);
					исключение
						Сообщить("Не удалось записать номер документу: "+стр.ссылка);
					конецпопытки;
				конецесли;	
			конецесли;	
		конеццикла;	
	конецесли;
КонецПроцедуры
